docs/inclass01A.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 16:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 1A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 1A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org614257d">1. Instructions</a></li>
<li><a href="#orgda69c13">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org614257d" class="outline-2">
<h2 id="org614257d"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the following specification and implementation:
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #b58900;">tail</span> (<span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">list</span>) {

   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">REQUIRES: ???</span>
   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">EFFECTS:  ???</span>

   <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt; <span style="color: #268bd2;">result</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">Integer</span>&gt;(list);
   result.remove(0);
   <span style="color: #859900; font-weight: bold;">return</span> result;
}
</pre>
</div>

<ol class="org-ol">
<li>What does the <b>implementation</b> of <code>tail</code> do in each of the following cases? How do you know: Running the code or reading an API description?
<ul class="org-ul">
<li><code>list = null</code></li>
<li><code>list = []</code></li>
<li><code>list = [1]</code></li>
<li><code>list = [1, 2, 3]</code></li>
</ul></li>
<li>Write a partial specification that matches the "happy path" part of the implementation's behavior.</li>
<li>Rewrite the specification to be total. Use Bloch's standard exceptions.</li>
<li>The resulting specification has a problem. What is it?</li>
<li>Rewrite the specification to address this problem. Rewrite the code to match the new specification.</li>
</ol>
</div>
</div>

<div id="outline-container-orgda69c13" class="outline-2">
<h2 id="orgda69c13"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
